include makefiles/gitignore.mk
include makefiles/rq.mk
include makefiles/help.mk

################################################################################
# 変数
################################################################################

################################################################################
# マクロ
################################################################################

################################################################################
# タスク
################################################################################
.PHONY: deploy-docs
deploy-docs: ## ドキュメントをデプロイする
	git subtree push --prefix docs/html/ origin gh-pages

.PHONY: csv2json
csv2json: data.csv ## data.csvをdata.jsonに出力
	cat data.csv | ./csv2json.sh | jq '.' | tee data.json
